app/Http/Controllers/OrderItemController.php

    function store(Request $request) {

        $id = 3;

         $orders = new Order;
         $orders->customer_id = Customer::where('id','=',$id)->first();
---
select * from `customers` where `id` is null limit 1