app/Providers/ProductServiceProvider.php

select * from `categories` where `seller_id` = 7
select * from `products` where `products`.`category_id` in (1, 7, 8, 9, 10, 18)
---
    public function boot()
    {
        View::composer(['layouts.ecommerce.productAvailable','layouts.ecommerce.product','layouts.ecommerce.bill'],function($view) {
        $view->with('product', Category::where('seller_id', Auth::guard('seller')->user()->id)->with(['products'])->get());